Revit 2027 API
BuiltInFailures.FamilyFailures.SlantedColumnEndCutPlaneIsParallelToGeometry Property
 Cut plane of slanted column end is parallel to the location curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlantedColumnEndCutPlaneIsParallelToGeometry { get; }
Public Shared ReadOnly Property SlantedColumnEndCutPlaneIsParallelToGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlantedColumnEndCutPlaneIsParallelToGeometry {
	FailureDefinitionId^ get ();
}
static member SlantedColumnEndCutPlaneIsParallelToGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace